SChristophS/GrowBox_NG/growbox-controller/STM32f4_GCU/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include <string.h>
#include "stm32f4xx_hal.h"
#include <stdint.h>
#include <stdbool.h>
#include "socket.h"
#include "stdlib.h"
#include "math.h"

/* other */
#include "controller_state.h"
#include "uart_redirect.h"
#include "wizchip_init.h"


/* Tasks */
#include "task_alive.h"
#include "task_hardware.h"
#include "task_light_controller.h"
#include "task_network.h"
#include "task_sensor.h"
#include "task_state_manager.h"
//#include "task_watcher.h"
#include "task_water_controller.h"

#include "globals.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */



/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */


/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c2;

SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim6;
TIM_HandleTypeDef htim10;

UART_HandleTypeDef huart2;

/* Definitions for AliveTask */
osThreadId_t AliveTaskHandle;
const osThreadAttr_t AliveTask_attributes = {
  .name = "AliveTask",
  .stack_size = 256 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for NetworkTask */
osThreadId_t NetworkTaskHandle;
const osThreadAttr_t NetworkTask_attributes = {
  .name = "NetworkTask",
  .stack_size = 1024 * 4,
  .priority = (osPriority_t) osPriorityAboveNormal,
};
/* Definitions for WaterController */
osThreadId_t WaterControllerHandle;
const osThreadAttr_t WaterController_attributes = {
  .name = "WaterController",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityNormal1,
};
/* Definitions for LightTask */
osThreadId_t LightTaskHandle;
const osThreadAttr_t LightTask_attributes = {
  .name = "LightTask",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityNormal2,
};
/* Definitions for SensorTask */
osThreadId_t SensorTaskHandle;
const osThreadAttr_t SensorTask_attributes = {
  .name = "SensorTask",
  .stack_size = 256 * 4,
  .priority = (osPriority_t) osPriorityLow,
};
/* Definitions for HardwareTask */
osThreadId_t HardwareTaskHandle;
const osThreadAttr_t HardwareTask_attributes = {
  .name = "HardwareTask",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityAboveNormal,
};
/* Definitions for xWaterControllerQueue */
osMessageQueueId_t xWaterControllerQueueHandle;
const osMessageQueueAttr_t xWaterControllerQueue_attributes = {
  .name = "xWaterControllerQueue"
};
/* Definitions for xLightControllerQueue */
osMessageQueueId_t xLightControllerQueueHandle;
const osMessageQueueAttr_t xLightControllerQueue_attributes = {
  .name = "xLightControllerQueue"
};
/* Definitions for xWebSocketQueue */
osMessageQueueId_t xWebSocketQueueHandle;
const osMessageQueueAttr_t xWebSocketQueue_attributes = {
  .name = "xWebSocketQueue"
};
/* Definitions for xHardwareQueue */
osMessageQueueId_t xHardwareQueueHandle;
const osMessageQueueAttr_t xHardwareQueue_attributes = {
  .name = "xHardwareQueue"
};
/* Definitions for gControllerStateMutex */
osMutexId_t gControllerStateMutexHandle;
const osMutexAttr_t gControllerStateMutex_attributes = {
  .name = "gControllerStateMutex"
};
/* Definitions for gGrowCycleConfigMutex */
osMutexId_t gGrowCycleConfigMutexHandle;
const osMutexAttr_t gGrowCycleConfigMutex_attributes = {
  .name = "gGrowCycleConfigMutex"
};
/* Definitions for gControllerEventGroup */
osEventFlagsId_t gControllerEventGroupHandle;
const osEventFlagsAttr_t gControllerEventGroup_attributes = {
  .name = "gControllerEventGroup"
};
/* USER CODE BEGIN PV */

// Definiere hier deine globalen Variablen
ControllerState gControllerState;
GrowCycleConfig gGrowCycleConfig;

char uidStr[25];

// Mutexe und Event-Gruppen
osMutexId_t gControllerStateMutexHandle;
osMutexId_t gGrowCycleConfigMutexHandle;
osEventFlagsId_t gControllerEventGroupHandle;

// Queues
osMessageQueueId_t xWaterControllerQueueHandle;
osMessageQueueId_t xLightControllerQueueHandle;
osMessageQueueId_t xWebSocketQueueHandle;
osMessageQueueId_t xHardwareQueueHandle;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_SPI1_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM6_Init(void);
static void MX_TIM10_Init(void);
static void MX_I2C2_Init(void);
void StartAliveTask(void *argument);
void StartNetworkTask(void *argument);
void StartWaterControllerTask(void *argument);
void StartLightTask(void *argument);
void StartSensorTask(void *argument);
void StartHardwareTask(void *argument);

/* USER CODE BEGIN PFP */
void InitControllerState(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
// UID auslesen und anzeigen
void GetSTM32UID(char *uidStr) {
    uint32_t uid[3];
    uid[0] = *(uint32_t *)0x1FFF7A10;
    uid[1] = *(uint32_t *)0x1FFF7A14;
    uid[2] = *(uint32_t *)0x1FFF7A18;

    if (sprintf(uidStr, "%08lX%08lX%08lX", uid[0], uid[1], uid[2]) < 0) {
        printf("task_network.c:\t - Error formatting UID string\r\n");
        return;
    }
}




