SChristophS/GrowBox_NG/growbox-controller/STM32f4_GCU/Core/Src/main.c
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI1_Init();
  MX_USART2_UART_Init();
  MX_SPI2_Init();
  MX_TIM3_Init();
  MX_TIM6_Init();
  MX_TIM10_Init();
  MX_I2C2_Init();
  /* USER CODE BEGIN 2 */

  printf("main.c:\t - NextGeneration Growbox Project - \r\n");

  resetAssert();
  HAL_Delay(300);
  resetDeassert();
  HAL_Delay(300);


  // Initialisiere gControllerState
  gControllerState.wasserbeckenZustand = false;
  gControllerState.pumpeZulauf = false;
  gControllerState.pumpeAblauf = false;
  gControllerState.sensorOben = false;
  gControllerState.sensorUnten = false;
  gControllerState.lightIntensity = 0;
  gControllerState.readyForAutoRun = false;





  printf("main.c:\t - done\r\n");



  GetSTM32UID(uidStr);
  printf("main.c:\t STM32 UID ausgelesen und gespeichert: %s\r\n", uidStr);

  //
  printf("Size of MessageForWebSocket: %lu bytes\n", (unsigned long)sizeof(MessageForWebSocket));



//   Init gControllerState as false
  gControllerState.wasserbeckenZustand = false;
  gControllerState.pumpeZulauf = false;
  gControllerState.pumpeAblauf = false;
  gControllerState.sensorOben = false;
  gControllerState.sensorUnten = false;
  gControllerState.lightIntensity = 0;
  gControllerState.readyForAutoRun = false;



  /* USER CODE END 2 */

  /* Init scheduler */
  osKernelInitialize();
  /* Create the mutex(es) */
  /* creation of gControllerStateMutex */
  gControllerStateMutexHandle = osMutexNew(&gControllerStateMutex_attributes);

  /* creation of gGrowCycleConfigMutex */
  gGrowCycleConfigMutexHandle = osMutexNew(&gGrowCycleConfigMutex_attributes);

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the queue(s) */
  /* creation of xWaterControllerQueue */
  xWaterControllerQueueHandle = osMessageQueueNew (1, sizeof(uint8_t), &xWaterControllerQueue_attributes);

  /* creation of xLightControllerQueue */
  xLightControllerQueueHandle = osMessageQueueNew (1, sizeof(uint8_t), &xLightControllerQueue_attributes);

  /* creation of xWebSocketQueue */
  xWebSocketQueueHandle = osMessageQueueNew (1, 6, &xWebSocketQueue_attributes);

  /* creation of xHardwareQueue */
  xHardwareQueueHandle = osMessageQueueNew (1, 4, &xHardwareQueue_attributes);

  /* USER CODE BEGIN RTOS_QUEUES */
  if (xWaterControllerQueueHandle == NULL) {
        printf("main.c:\t Error: Failed to create xWaterControllerQueue\r\n");
    }

  if (xLightControllerQueueHandle == NULL) {
      printf("main.c:\t Error: Failed to create xLightControllerQueue\r\n");
  }

  if (xHardwareQueueHandle == NULL) {
       printf("main.c:\t Error: Failed to create xAutoGrowQueue\r\n");
   }

  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* creation of AliveTask */
  AliveTaskHandle = osThreadNew(StartAliveTask, NULL, &AliveTask_attributes);

  /* creation of NetworkTask */
  NetworkTaskHandle = osThreadNew(StartNetworkTask, NULL, &NetworkTask_attributes);

  /* creation of WaterController */
  WaterControllerHandle = osThreadNew(StartWaterControllerTask, NULL, &WaterController_attributes);

  /* creation of LightTask */
  LightTaskHandle = osThreadNew(StartLightTask, NULL, &LightTask_attributes);

  /* creation of SensorTask */
  SensorTaskHandle = osThreadNew(StartSensorTask, NULL, &SensorTask_attributes);

  /* creation of HardwareTask */
  HardwareTaskHandle = osThreadNew(StartHardwareTask, NULL, &HardwareTask_attributes);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* creation of gControllerEventGroup */
  gControllerEventGroupHandle = osEventFlagsNew(&gControllerEventGroup_attributes);

  /* USER CODE BEGIN RTOS_EVENTS */

  printf("main.c:\t - check if all Tasks are created correctly...");
  // check if all Tasks are created correctly
  if (AliveTaskHandle == NULL) {
	printf("main.c:\t - Error: Failed to create AliveTask\r\n");
    Error_Handler();
  }
   if (NetworkTaskHandle == NULL) {
	printf("main.c:\t - Error: Failed to create NetworkTaskHandle\r\n");
    Error_Handler();
  }

  if (WaterControllerHandle == NULL) {
	printf("main.c:\t - Error: Failed to create WaterControllerHandle\r\n");
    Error_Handler();
  }


  if (LightTaskHandle == NULL) {
	printf("main.c:\t - Error: Failed to create LightTaskHandle\r\n");
    Error_Handler();
  }

  if (SensorTaskHandle == NULL) {
	printf("main.c:\t - Error: Failed to create SensorTaskHandle\r\n");
    Error_Handler();
  }

  if (HardwareTaskHandle == NULL) {
	printf("main.c:\t - Error: Failed to create HardwareTaskHandle\r\n");
    Error_Handler();
  }

  printf("main.c:\t - done\r\n");


  /* add events, ... */

  /* USER CODE END RTOS_EVENTS */

  /* Start scheduler */
  osKernelStart();

  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief I2C2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C2_Init(void)
{

